function ww=w_Attribute_1(X)   %---适用于决策矩阵给的是群体决策矩阵---%
[n m]=size(X); 
k=n/4;%  专家的个数  
mm=m/4;  %属性的个数
 for i=1:k
     dk(1+4*(i-1):4*i,:)=X([i i+3 i+3*2 i+3*3],:);
 end
         for j=1:4
            for jj=1:mm
             dk_A(j,1+4*(jj-1))=1-(1-dk(j,1+4*(jj-1)))^(1/3)*(dk(j+4,1+4*(jj-1)))^(1/3)*(dk(j+4*2,1+4*(jj-1)))^(1/3);
             dk_A(j,2+4*(jj-1))=1-(1-dk(j,2+4*(jj-1)))^(1/3)*(dk(j+4,2+4*(jj-1)))^(1/3)*(dk(j+4*2,2+4*(jj-1)))^(1/3);
             dk_A(j,3+4*(jj-1))=(dk(j,3+4*(jj-1)))^(1/3)*(dk(j+4,3+4*(jj-1)))^(1/3)*(dk(j+4*2,3+4*(jj-1)))^(1/3);
             dk_A(j,4+4*(jj-1))=(dk(j,4+4*(jj-1)))^(1/3)*(dk(j+4,4+4*(jj-1)))^(1/3)*(dk(j+4*2,4+4*(jj-1)))^(1/3);
            end
         end
w(1)=our_pro_tr(dk(1:4,:),dk_A);
w(2)=our_pro_tr(dk(5:8,:),dk_A);
w(3)=our_pro_tr(dk(9:12,:),dk_A);
w
dk_A
ww=w/sum(w);
end
